Revit 2027 API
GroupTypeId.EnergyAnalysis Property
 Energy Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysis { get; }
Public Shared ReadOnly Property EnergyAnalysis As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysis {
	ForgeTypeId^ get ();
}
static member EnergyAnalysis : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace